LedgerHQ/nanos-nonsecure-firmware/build/stm32f042_nanos_seproxyhal/src/usbd_conf.c
  HAL_PCD_EP_SetStall(pdev->pData, ep_addr);
  return USBD_OK; 
}

/**
  * @brief  Clears a Stall condition on an endpoint of the Low Level Driver.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef  USBD_LL_ClearStallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
  if ((G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SETUP) && (ep_addr & 0x7F) == 0) {
    return USBD_OK;
  }

  HAL_PCD_EP_ClrStall(pdev->pData, ep_addr);  
  return USBD_OK; 
}

/**
  * @brief  Returns Stall condition.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval Stall (1: Yes, 0: No)
  */
uint8_t USBD_LL_IsStallEP (USBD_HandleTypeDef *pdev, uint8_t ep_addr)   
{
  PCD_HandleTypeDef *hpcd = pdev->pData; 
  
  if((ep_addr & 0x80) == 0x80)
  {
    return hpcd->IN_ep[ep_addr & 0x7F].is_stall; 
  }
  else
  {
    return hpcd->OUT_ep[ep_addr & 0x7F].is_stall; 
  }
}
/**
  * @brief  Assigns a USB address to the device.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval USBD Status
  */
USBD_StatusTypeDef  USBD_LL_SetUSBAddress (USBD_HandleTypeDef *pdev, uint8_t dev_addr)   
{
  
  HAL_PCD_SetAddress(pdev->pData, dev_addr);
  return USBD_OK; 
}

/**
  * @brief  Transmits data over an endpoint.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @param  pbuf: Pointer to data to be sent
  * @param  size: Data size    
  * @retval USBD Status
  */
USBD_StatusTypeDef  USBD_LL_Transmit (USBD_HandleTypeDef *pdev, 
                                      uint8_t  ep_addr,                                      
                                      uint8_t  *pbuf,
                                      uint16_t  size)
{
  //HAL_NVIC_DisableIRQ(USB_IRQn);
  
  while (PCD_GET_EP_TX_STATUS(hpcd_USB_OTG_FS.Instance, (ep_addr & 0x7F)) == USB_EP_TX_VALID);
  
  __asm volatile ("cpsid i");

  if ((G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SETUP) && (ep_addr & 0x7F) == 0) {
    goto end;
  }

  
  // prepare transmit
  HAL_PCD_EP_Transmit(pdev->pData, ep_addr, pbuf, size);

end:
  //HAL_NVIC_EnableIRQ(USB_IRQn);
  __asm volatile ("cpsie i");

  return USBD_OK;   
}

HAL_StatusTypeDef HAL_PCD_EP_Transmi_delay(PCD_HandleTypeDef *hpcd, uint8_t ep_addr, uint8_t *pBuf, uint32_t len);
USBD_StatusTypeDef  USBD_LL_Transmit_delay (USBD_HandleTypeDef *pdev, 
                                      uint8_t  ep_addr,                                      
                                      uint8_t  *pbuf, 
                                      uint16_t  size) {
  while (PCD_GET_EP_TX_STATUS(hpcd_USB_OTG_FS.Instance, (ep_addr & 0x7F)) == USB_EP_TX_VALID);
  
  //__asm volatile ("cpsid i");

  if ((G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SETUP) && (ep_addr & 0x7F) == 0) {
    goto end;
  }

  
  // prepare transmit
  HAL_PCD_EP_Transmit_delay(pdev->pData, ep_addr, pbuf, size);

end:
  //__asm volatile ("cpsie i");

  return USBD_OK;   
}

HAL_StatusTypeDef HAL_PCD_EP_Transmit_exec(PCD_HandleTypeDef *hpcd, uint8_t ep_addr);
USBD_StatusTypeDef  USBD_LL_Transmit_exec (USBD_HandleTypeDef *pdev, 
                                      uint8_t  ep_addr) {
  return HAL_PCD_EP_Transmit_exec(pdev->pData, ep_addr);
}

/**
  * @brief  Prepares an endpoint for reception.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @param  pbuf: Pointer to data to be received
  * @param  size: Data size
  * @retval USBD Status
  */
USBD_StatusTypeDef  USBD_LL_PrepareReceive(USBD_HandleTypeDef *pdev, 
                                           uint8_t  ep_addr,                                      
                                           uint16_t  size)
{
  //HAL_NVIC_DisableIRQ(USB_IRQn);
  //__asm volatile ("cpsid i");

  if ((G_io_seproxyhal_events & SEPROXYHAL_EVENT_USB_SETUP) && (ep_addr & 0x7F) == 0) {
    goto end;
  }

  HAL_PCD_EP_Receive(pdev->pData, ep_addr, NULL /*G_io_usb.ep_out_buff[ep_addr&0x7F]*/, size);

end:
  //HAL_NVIC_EnableIRQ(USB_IRQn);
  //__asm volatile ("cpsie i");

  return USBD_OK;   
}

/**
  * @brief  Returns the last transfered packet size.
  * @param  pdev: Device handle
  * @param  ep_addr: Endpoint Number
  * @retval Recived Data Size
  */
uint32_t USBD_LL_GetRxDataSize  (USBD_HandleTypeDef *pdev, uint8_t  ep_addr)  
{
  return HAL_PCD_EP_GetRxCount(pdev->pData, ep_addr);
}


/**
  * @brief  Delays routine for the USB Device Library.
  * @param  Delay: Delay in ms
  * @retval None
  */
void  USBD_LL_Delay (uint32_t Delay)
{
  HAL_Delay(Delay);  
}



/**
* @brief Software Device Connection
* @param hpcd: PCD handle
* @param state: connection state (0 : disconnected / 1: connected) 
* @retval None
*/
void HAL_PCDEx_SetConnectionState(PCD_HandleTypeDef *hpcd, uint8_t state)
{
/* USER CODE BEGIN 6 */
  if (state == 1)
  {
    /* Configure Low Connection State */
	
  }
  else
  {
    /* Configure High Connection State */
   
  } 
/* USER CODE END 6 */
}

/**
  * @brief  Verify if the Battery Charging Detection mode (BCD) is used :
  *         return USBD_OK if true
  *         else return USBD_FAIL if false
  * @param  pdev: Device handle
  * @retval USBD Status
  */
USBD_StatusTypeDef USBD_LL_BatteryCharging(USBD_HandleTypeDef *pdev)
{
  PCD_HandleTypeDef *hpcd = (PCD_HandleTypeDef*)pdev->pData;
  if (hpcd->Init.battery_charging_enable == ENABLE) 
  {
    return USBD_OK;
  }
  else
  {
    return USBD_FAIL;
  }
}

#define CHANNEL_APDU 0
#define CHANNEL_KEYBOARD 1
#define CHANNEL_SPI 2
#define IO_RESET_AFTER_REPLIED 0x80
#define IO_RECEIVE_DATA 0x40
#define IO_RETURN_AFTER_TX 0x20
#define IO_FLAGS 0xF0

typedef enum io_usb_hid_receive_status_e {
  IO_USB_APDU_RESET,
  IO_USB_APDU_MORE_DATA,
  IO_USB_APDU_RECEIVED,
} io_usb_hid_receive_status_t;

typedef void (*io_send_t)(unsigned char* buffer, unsigned short length);

typedef unsigned short (*io_recv_t)(unsigned char* buffer, unsigned short maxlenth);



