LedgerHQ/nanos-nonsecure-firmware/build/stm32f042_nanos_seproxyhal/src/usbd_conf.c
extern volatile unsigned short G_io_apdu_length;

/**
 *  Ledger Protocol with FIDO injection
 *  HID Report Content
 *  [______________________________]
 *   CCCC TT VVVV.........VV FILL..
 *
 *  All fields are big endian encoded.
 *  CCCC: 2 bytes channel identifier (when multi application are processing).
 *  TT: 1 byte content tag
 *  VVVV..VV: variable length content
 *  FILL..: 00's to fillup the HID report length
 *
 *  LL is at most the length of the HID Report.
 *
 *  Command/Response APDU are split in chunks.
 * 
 *  Filler only allowed at the end of the last hid report of a apdu chain in each direction.
 * 
 *  APDU are using either standard or extended header. up to the application to check the total received length and the lc field
 *
 *  Tags:
 *  Direction:Host>Token T:0x00 V:no  Get protocol version big endian encoded. Replied with a protocol-version. Channel identifier is ignored for this command.
 *  Direction:Token>Host T:0x00 V:yes protocol-version-4-bytes-big-endian. Channel identifier is ignored for this reply.
 *  Direction:Host>Token T:0x01 V:no  Allocate channel. Replied with a channel identifier. Channel identifier is ignored for this command.
 *  Direction:Token>Host T:0x01 V:yes channel-identifier-2-bytes. Channel identifier is ignored for this reply.
 *  Direction:*          T:0x02 V:no  Ping. replied with a ping. Channel identifier is ignored for this command.
 *  NOTSUPPORTED Direction:*          T:0x03 V:no  Abort. replied with an abort if accepted, else not replied.
 *  Direction:*          T:0x05 V=<sequence-idx-U16><seq==0?totallength:NONE><apducontent> APDU (command/response) packet.
 */

volatile unsigned int   G_io_usb_hid_total_length;
volatile unsigned int   G_io_usb_hid_remaining_length;
volatile unsigned int   G_io_usb_hid_sequence_number;
volatile unsigned char* G_io_usb_hid_current_buffer;


void io_usb_hid_init(void) {
  G_io_usb_hid_sequence_number = 0; 
  //G_io_usb_hid_remaining_length = 0; // not really needed
  //G_io_usb_hid_total_length = 0; // not really needed
  //G_io_usb_hid_current_buffer = G_io_apdu_buffer; // not really needed
}

io_usb_hid_receive_status_t io_usb_hid_receive (io_send_t sndfct, unsigned char* buffer, unsigned short l) {
  /*
  // avoid over/under flows
  memset(G_io_hid_chunk, 0, sizeof(G_io_hid_chunk));
  memcpy(G_io_hid_chunk, buffer, MIN(l, sizeof(G_io_hid_chunk)));
  */
  
  // process the chunk content
  switch(G_io_hid_chunk[2]) {
  case 0x05:
    // ensure sequence idx is 0 for the first chunk ! 
    if (G_io_hid_chunk[3] != (G_io_usb_hid_sequence_number>>8) || G_io_hid_chunk[4] != (G_io_usb_hid_sequence_number&0xFF)) {
      // ignore packet
      goto apdu_reset;
    }
    // cid, tag, seq
    l -= 2+1+2;
    
    // append the received chunk to the current command apdu
    if (G_io_usb_hid_sequence_number == 0) {
      /// This is the apdu first chunk
      // total apdu size to receive
      G_io_usb_hid_total_length = (G_io_hid_chunk[5]<<8)+(G_io_hid_chunk[6]&0xFF);
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      if (G_io_usb_hid_total_length > sizeof(G_io_apdu_buffer)) {
        goto apdu_reset;
      }
      // seq and total length
      l -= 2;
      // compute remaining size to receive
      G_io_usb_hid_remaining_length = G_io_usb_hid_total_length;
      G_io_usb_hid_current_buffer = G_io_apdu_buffer;

      if (l > G_io_usb_hid_remaining_length) {
        l = G_io_usb_hid_remaining_length;
      }
      // copy data
      memcpy(G_io_usb_hid_current_buffer, G_io_hid_chunk+7, l);
    }
    else {
      // check for invalid length encoding (more data in chunk that announced in the total apdu)
      if (l > G_io_usb_hid_remaining_length) {
        l = G_io_usb_hid_remaining_length;
      }

      /// This is a following chunk
      // append content
      memcpy(G_io_usb_hid_current_buffer, G_io_hid_chunk+5, l);
    }
    // factorize (f)
    G_io_usb_hid_current_buffer += l;
    G_io_usb_hid_remaining_length -= l;
    G_io_usb_hid_sequence_number++;
    break;

  case 0x00: // get version ID
    // do not reset the current apdu reception if any
    memset(G_io_hid_chunk+3, 0, 4); // PROTOCOL VERSION is 0
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;

  case 0x01: // ALLOCATE CHANNEL
    // do not reset the current apdu reception if any
    memset(G_io_hid_chunk+3, 0, 4);
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;

  case 0x02: // ECHO|PING
    // do not reset the current apdu reception if any
    // send the response
    sndfct(G_io_hid_chunk, IO_HID_EP_LENGTH);
    // await for the next chunk
    goto apdu_reset;
  }

  // if more data to be received, notify it
  if (G_io_usb_hid_remaining_length) {
    return IO_USB_APDU_MORE_DATA;
  }

  // reset sequence number for next exchange
  io_usb_hid_init();
  return IO_USB_APDU_RECEIVED;

apdu_reset:
  io_usb_hid_init();
  return IO_USB_APDU_RESET;
}

unsigned short io_usb_hid_exchange(io_send_t sndfct, unsigned short sndlength,
                                   unsigned char flags) {
  unsigned char l;

  // perform send
  if (sndlength) {
    G_io_usb_hid_sequence_number = 0; 
    G_io_usb_hid_current_buffer = G_io_apdu_buffer;
    // consume previous command apdu
    G_io_apdu_length = 0;
    while(sndlength) {

      // fill the chunk
      memset(G_io_hid_chunk+2, 0, IO_HID_EP_LENGTH-2);

      // keep the channel identifier
      G_io_hid_chunk[2] = 0x05;
      G_io_hid_chunk[3] = G_io_usb_hid_sequence_number>>8;
      G_io_hid_chunk[4] = G_io_usb_hid_sequence_number;

      if (G_io_usb_hid_sequence_number == 0) {
        l = ((sndlength>IO_HID_EP_LENGTH-7) ? IO_HID_EP_LENGTH-7 : sndlength);
        G_io_hid_chunk[5] = sndlength>>8;
        G_io_hid_chunk[6] = sndlength;
        memcpy(G_io_hid_chunk+7, G_io_usb_hid_current_buffer, l);
        G_io_usb_hid_current_buffer += l;
        sndlength -= l;
        l += 7;
      }
      else {
        l = ((sndlength>IO_HID_EP_LENGTH-5) ? IO_HID_EP_LENGTH-5 : sndlength);
        memcpy(G_io_hid_chunk+5, G_io_usb_hid_current_buffer, l);
        G_io_usb_hid_current_buffer += l;
        sndlength -= l;
        l += 5;
      }
      // prepare next chunk numbering
      G_io_usb_hid_sequence_number++;

      // this is the last chunk to be sent
      if (!sndlength) {
        // prepare for next apdu
        io_usb_hid_init();     
		G_io_apdu_length = 0;   
      }

      // always pad :)
      // send the chunk
      sndfct(G_io_hid_chunk, sizeof(G_io_hid_chunk));
    }
  }

  if (flags & IO_RESET_AFTER_REPLIED) {
    NVIC_SystemReset();
  }

  if (flags & IO_RETURN_AFTER_TX ) {
    return 0;
  }

  return G_io_apdu_length;
}


extern USBD_HandleTypeDef USBD_Device;
void io_usb_send_apdu_data(unsigned char* buffer, unsigned short length) {
  USBD_LL_Transmit(&USBD_Device, 0x82, buffer, length);
}

int8_t CUSTOM_HID_OutEvent  (uint8_t* hid_report)
{ 
  if (hid_report) {
    // add to the hid transport
    switch(io_usb_hid_receive(io_usb_send_apdu_data, hid_report, hpcd_USB_OTG_FS.OUT_ep[2].xfer_count)) {
      default:
        break;

      case IO_USB_APDU_RECEIVED:
        G_io_apdu_length = G_io_usb_hid_total_length;
        break;
    }
  }
  return (0);
}


unsigned short io_exchange(unsigned char channel_and_flags, unsigned short tx_length) {
  return io_usb_hid_exchange(io_usb_send_apdu_data, tx_length, channel_and_flags);
}

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
